{"id": 1, "topic": "Algebra", "content": "Algebra is a branch of mathematics that uses symbols and letters to represent numbers and quantities in equations and formulas."}
{"id": 2, "topic": "Algebra", "content": "Variables in algebra represent unknown values that can change depending on the context of the problem."}
{"id": 3, "topic": "Algebra", "content": "Linear equations are equations of the first order, such as y = mx + b, where m is the slope and b is the y-intercept."}
{"id": 4, "topic": "Algebra", "content": "Quadratic equations are polynomial equations of the second degree, typically written as ax² + bx + c = 0."}
{"id": 5, "topic": "Geometry", "content": "Geometry is a branch of mathematics that deals with the properties, measurement, and relationships of points, lines, angles, surfaces, and solids."}
{"id": 6, "topic": "Geometry", "content": "The Pythagorean theorem states that in a right-angled triangle, the square of the hypotenuse is equal to the sum of the squares of the other two sides."}
{"id": 7, "topic": "Geometry", "content": "A circle is a shape consisting of all points in a plane that are at a given distance from a given point, the center."}
{"id": 8, "topic": "Calculus", "content": "Calculus is a branch of mathematics that studies continuous change, primarily through differentiation and integration."}
{"id": 9, "topic": "Calculus", "content": "Derivatives measure how a function changes as its input changes, representing the rate of change."}
{"id": 10, "topic": "Calculus", "content": "Integration is the process of finding the area under a curve and is the inverse operation of differentiation."}
{"id": 11, "topic": "Statistics", "content": "Statistics is the discipline that concerns the collection, organization, analysis, interpretation, and presentation of data."}
{"id": 12, "topic": "Statistics", "content": "Mean, median, and mode are measures of central tendency that describe the center of a data set."}
{"id": 13, "topic": "Trigonometry", "content": "Trigonometry is the branch of mathematics that studies relationships between side lengths and angles of triangles."}
{"id": 14, "topic": "Trigonometry", "content": "The basic trigonometric functions are sine, cosine, and tangent, which relate the angles of a triangle to the lengths of its sides."}
{"id": 15, "topic": "Mathematical Proofs", "content": "A mathematical proof is an inferential argument for a mathematical statement, showing that the stated assumptions logically guarantee the conclusion."}